/* automatically generated by rust-bindgen 0.69.1 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(unused)]
pub const GGMLSYS_VERSION: Option<&str> = option_env!("CARGO_PKG_VERSION");

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    pub type ggml_fp16_t = u16;
    pub type ggml_unary_op_f32_t = ::std::option::Option<
        unsafe extern "C" fn(arg1: ::std::os::raw::c_int, arg2: *mut f32, arg3: *const f32),
    >;
    pub type ggml_binary_op_f32_t = ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut f32,
            arg3: *const f32,
            arg4: *const f32,
        ),
    >;
    pub type ggml_custom1_op_f32_t = ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut root::ggml_tensor, arg2: *const root::ggml_tensor),
    >;
    pub type ggml_custom2_op_f32_t = ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut root::ggml_tensor,
            arg2: *const root::ggml_tensor,
            arg3: *const root::ggml_tensor,
        ),
    >;
    pub type ggml_custom3_op_f32_t = ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut root::ggml_tensor,
            arg2: *const root::ggml_tensor,
            arg3: *const root::ggml_tensor,
            arg4: *const root::ggml_tensor,
        ),
    >;
    pub type ggml_custom1_op_t = ::std::option::Option<

            ),
        >,
        pub cpy_tensor_to_async: ::std::option::Option<
            unsafe extern "C" fn(
                backend: root::ggml_backend_t,
                src: *mut root::ggml_tensor,
                dst: *mut root::ggml_tensor,
            ),
        >,
        pub synchronize: ::std::option::Option<unsafe extern "C" fn(backend: root::ggml_backend_t)>,
        pub graph_plan_create: ::std::option::Option<
            unsafe extern "C" fn(
                backend: root::ggml_backend_t,
                cgraph: *mut root::ggml_cgraph,
            ) -> root::ggml_backend_graph_plan_t,
        >,
        pub graph_plan_free: ::std::option::Option<
            unsafe extern "C" fn(
                backend: root::ggml_backend_t,
                plan: root::ggml_backend_graph_plan_t,
            ),
        >,
        pub graph_plan_compute: ::std::option::Option<
            unsafe extern "C" fn(
                backend: root::ggml_backend_t,
                plan: root::ggml_backend_graph_plan_t,
            ),
        >,
        pub graph_compute: ::std::option::Option<
            unsafe extern "C" fn(backend: root::ggml_backend_t, cgraph: *mut root::ggml_cgraph),
        >,
        pub supports_op: ::std::option::Option<
            unsafe extern "C" fn(
                backend: root::ggml_backend_t,
                op: *const root::ggml_tensor,
            ) -> bool,
        >,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ggml_backend {
        pub iface: root::ggml_backend_i,
        pub context: root::ggml_backend_context_t,
    }
    pub const GGML_FILE_MAGIC: u32 = 1734831468;
    pub const GGML_FILE_VERSION: u32 = 1;
    pub const GGML_QNT_VERSION: u32 = 2;
    pub const GGML_QNT_VERSION_FACTOR: u32 = 1000;
    pub const GGML_MAX_DIMS: u32 = 4;
    pub const GGML_MAX_PARAMS: u32 = 2048;
    pub const GGML_MAX_CONTEXTS: u32 = 64;
    pub const GGML_MAX_SRC: u32 = 10;
    pub const GGML_MAX_NAME: u32 = 64;
    pub const GGML_MAX_OP_PARAMS: u32 = 64;
    pub const GGML_DEFAULT_N_THREADS: u32 = 4;
    pub const GGML_DEFAULT_GRAPH_SIZE: u32 = 2048;
    pub const GGML_MEM_ALIGN: u32 = 16;
    pub const GGML_EXIT_SUCCESS: u32 = 0;
    pub const GGML_EXIT_ABORTED: u32 = 1;
    pub const GGUF_MAGIC: &[u8; 5] = b"GGUF\0";
    pub const GGUF_VERSION: u32 = 3;
    pub const GGUF_DEFAULT_ALIGNMENT: u32 = 32;
    pub const GGML_N_TASKS_MAX: i32 = -1;
    pub const GGML_CUDA_NAME: &[u8; 5] = b"CUDA\0";
    pub const GGML_CUBLAS_NAME: &[u8; 7] = b"cuBLAS\0";
    pub const GGML_CUDA_MAX_DEVICES: u32 = 16;
    pub const GGML_OBJECT_SIZE: usize = 32;
    pub const GGML_TENSOR_SIZE: usize = 368;
    #[test]
    fn bindgen_test_layout_ggml_object() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_object> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_object>(),
            32usize,
            concat!("Size of: ", stringify!(ggml_object))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_object>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_object))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).offs) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_object),
                "::",
                stringify!(offs)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_object),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_object),
                "::",
                stringify!(next)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_object),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_object),
                "::",
                stringify!(padding)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_tensor() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_tensor> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_tensor>(),
            368usize,
            concat!("Size of: ", stringify!(ggml_tensor))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_tensor>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_tensor))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).backend) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(backend)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(buffer)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ne) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(ne)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).nb) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(nb)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).op) as usize - ptr as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(op)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).op_params) as usize - ptr as usize },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(op_params)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).is_param) as usize - ptr as usize },
            148usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(is_param)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).grad) as usize - ptr as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(grad)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(src)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).perf_runs) as usize - ptr as usize },
            240usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(perf_runs)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).perf_cycles) as usize - ptr as usize },
            248usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(perf_cycles)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).perf_time_us) as usize - ptr as usize },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(perf_time_us)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).view_src) as usize - ptr as usize },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(view_src)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).view_offs) as usize - ptr as usize },
            272usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(view_offs)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
            280usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(data)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
            288usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(name)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).extra) as usize - ptr as usize },
            352usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(extra)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
            360usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_tensor),
                "::",
                stringify!(padding)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_cplan() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_cplan> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_cplan>(),
            40usize,
            concat!("Size of: ", stringify!(ggml_cplan))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_cplan>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_cplan))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).work_size) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cplan),
                "::",
                stringify!(work_size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).work_data) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cplan),
                "::",
                stringify!(work_data)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_threads) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cplan),
                "::",
                stringify!(n_threads)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).abort_callback) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cplan),
                "::",
                stringify!(abort_callback)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).abort_callback_data) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cplan),
                "::",
                stringify!(abort_callback_data)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_hash_set() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_hash_set> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_hash_set>(),
            16usize,
            concat!("Size of: ", stringify!(ggml_hash_set))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_hash_set>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_hash_set))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_hash_set),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).keys) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_hash_set),
                "::",
                stringify!(keys)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_cgraph() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_cgraph> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_cgraph>(),
            80usize,
            concat!("Size of: ", stringify!(ggml_cgraph))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_cgraph>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_cgraph))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_nodes) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(n_nodes)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_leafs) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(n_leafs)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).nodes) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(nodes)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).grads) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(grads)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).leafs) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(leafs)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).visited_hash_table) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(visited_hash_table)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(order)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).perf_runs) as usize - ptr as usize },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(perf_runs)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).perf_cycles) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(perf_cycles)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).perf_time_us) as usize - ptr as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_cgraph),
                "::",
                stringify!(perf_time_us)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_scratch() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_scratch> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_scratch>(),
            24usize,
            concat!("Size of: ", stringify!(ggml_scratch))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_scratch>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_scratch))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).offs) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_scratch),
                "::",
                stringify!(offs)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_scratch),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_scratch),
                "::",
                stringify!(data)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_init_params() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_init_params> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_init_params>(),
            24usize,
            concat!("Size of: ", stringify!(ggml_init_params))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_init_params>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_init_params))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mem_size) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_init_params),
                "::",
                stringify!(mem_size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mem_buffer) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_init_params),
                "::",
                stringify!(mem_buffer)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).no_alloc) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_init_params),
                "::",
                stringify!(no_alloc)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_compute_params() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_compute_params> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_compute_params>(),
            32usize,
            concat!("Size of: ", stringify!(ggml_compute_params))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_compute_params>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_compute_params))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_compute_params),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ith) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_compute_params),
                "::",
                stringify!(ith)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).nth) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_compute_params),
                "::",
                stringify!(nth)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).wsize) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_compute_params),
                "::",
                stringify!(wsize)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).wdata) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_compute_params),
                "::",
                stringify!(wdata)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_opt_params__bindgen_ty_1() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_opt_params__bindgen_ty_1> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_opt_params__bindgen_ty_1>(),
            44usize,
            concat!("Size of: ", stringify!(ggml_opt_params__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_opt_params__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(ggml_opt_params__bindgen_ty_1))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_iter) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(n_iter)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).sched) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(sched)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).decay) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(decay)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).decay_min_ndim) as usize - ptr as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(decay_min_ndim)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).alpha) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(alpha)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).beta1) as usize - ptr as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(beta1)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).beta2) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(beta2)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).eps) as usize - ptr as usize },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(eps)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).eps_f) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(eps_f)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).eps_g) as usize - ptr as usize },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(eps_g)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).gclip) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_1),
                "::",
                stringify!(gclip)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_opt_params__bindgen_ty_2() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_opt_params__bindgen_ty_2> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_opt_params__bindgen_ty_2>(),
            36usize,
            concat!("Size of: ", stringify!(ggml_opt_params__bindgen_ty_2))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_opt_params__bindgen_ty_2>(),
            4usize,
            concat!("Alignment of ", stringify!(ggml_opt_params__bindgen_ty_2))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(m)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_iter) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(n_iter)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).max_linesearch) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(max_linesearch)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).eps) as usize - ptr as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(eps)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ftol) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(ftol)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).wolfe) as usize - ptr as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(wolfe)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).min_step) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(min_step)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).max_step) as usize - ptr as usize },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(max_step)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).linesearch) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params__bindgen_ty_2),
                "::",
                stringify!(linesearch)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_opt_params() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_opt_params> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_opt_params>(),
            120usize,
            concat!("Size of: ", stringify!(ggml_opt_params))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_opt_params>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_opt_params))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).graph_size) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(graph_size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_threads) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(n_threads)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).past) as usize - ptr as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(past)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).delta) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(delta)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).max_no_improvement) as usize - ptr as usize },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(max_no_improvement)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).print_forward_graph) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(print_forward_graph)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).print_backward_graph) as usize - ptr as usize },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(print_backward_graph)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_gradient_accumulation) as usize - ptr as usize },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(n_gradient_accumulation)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).adam) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(adam)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).lbfgs) as usize - ptr as usize },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_params),
                "::",
                stringify!(lbfgs)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_opt_context__bindgen_ty_1() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_opt_context__bindgen_ty_1> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_opt_context__bindgen_ty_1>(),
            48usize,
            concat!("Size of: ", stringify!(ggml_opt_context__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_opt_context__bindgen_ty_1>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_opt_context__bindgen_ty_1))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_1),
                "::",
                stringify!(g)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_1),
                "::",
                stringify!(m)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_1),
                "::",
                stringify!(v)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).pf) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_1),
                "::",
                stringify!(pf)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).fx_best) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_1),
                "::",
                stringify!(fx_best)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).fx_prev) as usize - ptr as usize },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_1),
                "::",
                stringify!(fx_prev)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_no_improvement) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_1),
                "::",
                stringify!(n_no_improvement)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_opt_context__bindgen_ty_2() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_opt_context__bindgen_ty_2> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_opt_context__bindgen_ty_2>(),
            104usize,
            concat!("Size of: ", stringify!(ggml_opt_context__bindgen_ty_2))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_opt_context__bindgen_ty_2>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_opt_context__bindgen_ty_2))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(x)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).xp) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(xp)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(g)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).gp) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(gp)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(d)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).pf) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(pf)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).lmal) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(lmal)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).lmys) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(lmys)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).lms) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(lms)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).lmy) as usize - ptr as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(lmy)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).fx_best) as usize - ptr as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(fx_best)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(step)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).j) as usize - ptr as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(j)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).k) as usize - ptr as usize },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(k)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(end)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_no_improvement) as usize - ptr as usize },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context__bindgen_ty_2),
                "::",
                stringify!(n_no_improvement)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_opt_context() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_opt_context> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_opt_context>(),
            312usize,
            concat!("Size of: ", stringify!(ggml_opt_context))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_opt_context>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_opt_context))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ctx) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(ctx)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).params) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(params)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).iter) as usize - ptr as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(iter)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).nx) as usize - ptr as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(nx)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).just_initialized) as usize - ptr as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(just_initialized)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).loss_before) as usize - ptr as usize },
            148usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(loss_before)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).loss_after) as usize - ptr as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(loss_after)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).adam) as usize - ptr as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(adam)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).lbfgs) as usize - ptr as usize },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_opt_context),
                "::",
                stringify!(lbfgs)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_init_params() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_init_params> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_init_params>(),
            16usize,
            concat!("Size of: ", stringify!(gguf_init_params))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_init_params>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_init_params))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).no_alloc) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_init_params),
                "::",
                stringify!(no_alloc)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ctx) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_init_params),
                "::",
                stringify!(ctx)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_type_traits_t() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_type_traits_t> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_type_traits_t>(),
            72usize,
            concat!("Size of: ", stringify!(ggml_type_traits_t))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_type_traits_t>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_type_traits_t))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_name) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(type_name)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).blck_size) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(blck_size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_size) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(type_size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).is_quantized) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(is_quantized)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).to_float) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(to_float)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).from_float) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(from_float)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).from_float_reference) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(from_float_reference)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).vec_dot) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(vec_dot)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).vec_dot_type) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_type_traits_t),
                "::",
                stringify!(vec_dot_type)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_backend_graph_copy() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_backend_graph_copy> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_backend_graph_copy>(),
            32usize,
            concat!("Size of: ", stringify!(ggml_backend_graph_copy))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_backend_graph_copy>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_backend_graph_copy))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_graph_copy),
                "::",
                stringify!(buffer)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ctx_allocated) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_graph_copy),
                "::",
                stringify!(ctx_allocated)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ctx_unallocated) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_graph_copy),
                "::",
                stringify!(ctx_unallocated)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).graph) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_graph_copy),
                "::",
                stringify!(graph)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_context() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_context> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_context>(),
            88usize,
            concat!("Size of: ", stringify!(ggml_context))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_context>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_context))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mem_size) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(mem_size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mem_buffer) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(mem_buffer)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mem_buffer_owned) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(mem_buffer_owned)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).no_alloc) as usize - ptr as usize },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(no_alloc)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).no_alloc_save) as usize - ptr as usize },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(no_alloc_save)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_objects) as usize - ptr as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(n_objects)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).objects_begin) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(objects_begin)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).objects_end) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(objects_end)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).scratch) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(scratch)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).scratch_save) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_context),
                "::",
                stringify!(scratch_save)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_str() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_str> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_str>(),
            16usize,
            concat!("Size of: ", stringify!(gguf_str))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_str>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_str))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_str),
                "::",
                stringify!(n)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_str),
                "::",
                stringify!(data)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_value__bindgen_ty_1() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_value__bindgen_ty_1> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_value__bindgen_ty_1>(),
            24usize,
            concat!("Size of: ", stringify!(gguf_value__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_value__bindgen_ty_1>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_value__bindgen_ty_1))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value__bindgen_ty_1),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value__bindgen_ty_1),
                "::",
                stringify!(n)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value__bindgen_ty_1),
                "::",
                stringify!(data)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_value() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_value> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_value>(),
            24usize,
            concat!("Size of: ", stringify!(gguf_value))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_value>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_value))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).uint8) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(uint8)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).int8) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(int8)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).uint16) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(uint16)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).int16) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(int16)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).uint32) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(uint32)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).int32) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(int32)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).float32) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(float32)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).uint64) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(uint64)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).int64) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(int64)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).float64) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(float64)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).bool_) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(bool_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(str_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).arr) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_value),
                "::",
                stringify!(arr)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_kv() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_kv> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_kv>(),
            48usize,
            concat!("Size of: ", stringify!(gguf_kv))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_kv>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_kv))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_kv),
                "::",
                stringify!(key)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_kv),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_kv),
                "::",
                stringify!(value)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_header() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_header> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_header>(),
            24usize,
            concat!("Size of: ", stringify!(gguf_header))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_header>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_header))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).magic) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_header),
                "::",
                stringify!(magic)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_header),
                "::",
                stringify!(version)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_tensors) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_header),
                "::",
                stringify!(n_tensors)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_kv) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_header),
                "::",
                stringify!(n_kv)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_tensor_info() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_tensor_info> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_tensor_info>(),
            88usize,
            concat!("Size of: ", stringify!(gguf_tensor_info))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_tensor_info>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_tensor_info))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_tensor_info),
                "::",
                stringify!(name)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).n_dims) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_tensor_info),
                "::",
                stringify!(n_dims)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ne) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_tensor_info),
                "::",
                stringify!(ne)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_tensor_info),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_tensor_info),
                "::",
                stringify!(offset)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_tensor_info),
                "::",
                stringify!(data)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_tensor_info),
                "::",
                stringify!(size)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_gguf_context() {
        const UNINIT: ::std::mem::MaybeUninit<gguf_context> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<gguf_context>(),
            72usize,
            concat!("Size of: ", stringify!(gguf_context))
        );
        assert_eq!(
            ::std::mem::align_of::<gguf_context>(),
            8usize,
            concat!("Alignment of ", stringify!(gguf_context))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_context),
                "::",
                stringify!(header)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).kv) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_context),
                "::",
                stringify!(kv)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).infos) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_context),
                "::",
                stringify!(infos)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).alignment) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_context),
                "::",
                stringify!(alignment)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_context),
                "::",
                stringify!(offset)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_context),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(gguf_context),
                "::",
                stringify!(data)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_backend_buffer_type_i() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_backend_buffer_type_i> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_backend_buffer_type_i>(),
            40usize,
            concat!("Size of: ", stringify!(ggml_backend_buffer_type_i))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_backend_buffer_type_i>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_backend_buffer_type_i))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).alloc_buffer) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_type_i),
                "::",
                stringify!(alloc_buffer)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).get_alignment) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_type_i),
                "::",
                stringify!(get_alignment)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).get_alloc_size) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_type_i),
                "::",
                stringify!(get_alloc_size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).supports_backend) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_type_i),
                "::",
                stringify!(supports_backend)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).is_host) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_type_i),
                "::",
                stringify!(is_host)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_backend_buffer_type() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_backend_buffer_type> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_backend_buffer_type>(),
            48usize,
            concat!("Size of: ", stringify!(ggml_backend_buffer_type))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_backend_buffer_type>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_backend_buffer_type))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).iface) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_type),
                "::",
                stringify!(iface)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_type),
                "::",
                stringify!(context)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_backend_buffer_i() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_backend_buffer_i> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_backend_buffer_i>(),
            64usize,
            concat!("Size of: ", stringify!(ggml_backend_buffer_i))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_backend_buffer_i>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_backend_buffer_i))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).free_buffer) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(free_buffer)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).get_base) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(get_base)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).init_tensor) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(init_tensor)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).set_tensor) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(set_tensor)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).get_tensor) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(get_tensor)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).cpy_tensor_from) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(cpy_tensor_from)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).cpy_tensor_to) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(cpy_tensor_to)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).clear) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer_i),
                "::",
                stringify!(clear)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_backend_buffer() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_backend_buffer> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_backend_buffer>(),
            88usize,
            concat!("Size of: ", stringify!(ggml_backend_buffer))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_backend_buffer>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_backend_buffer))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).iface) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer),
                "::",
                stringify!(iface)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).buft) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer),
                "::",
                stringify!(buft)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer),
                "::",
                stringify!(context)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_buffer),
                "::",
                stringify!(size)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_backend_i() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_backend_i> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_backend_i>(),
            104usize,
            concat!("Size of: ", stringify!(ggml_backend_i))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_backend_i>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_backend_i))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).get_name) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(get_name)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(free)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).get_default_buffer_type) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(get_default_buffer_type)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).set_tensor_async) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(set_tensor_async)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).get_tensor_async) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(get_tensor_async)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).cpy_tensor_from_async) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(cpy_tensor_from_async)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).cpy_tensor_to_async) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(cpy_tensor_to_async)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).synchronize) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(synchronize)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).graph_plan_create) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(graph_plan_create)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).graph_plan_free) as usize - ptr as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(graph_plan_free)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).graph_plan_compute) as usize - ptr as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(graph_plan_compute)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).graph_compute) as usize - ptr as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(graph_compute)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).supports_op) as usize - ptr as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend_i),
                "::",
                stringify!(supports_op)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_ggml_backend() {
        const UNINIT: ::std::mem::MaybeUninit<ggml_backend> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ggml_backend>(),
            112usize,
            concat!("Size of: ", stringify!(ggml_backend))
        );
        assert_eq!(
            ::std::mem::align_of::<ggml_backend>(),
            8usize,
            concat!("Alignment of ", stringify!(ggml_backend))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).iface) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend),
                "::",
                stringify!(iface)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(ggml_backend),
                "::",
                stringify!(context)
            )
        );
    }
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub enum ggml_type {
        F32 = 0,
        F16 = 1,
        Q4_0 = 2,
        Q4_1 = 3,
        Q5_0 = 6,
        Q5_1 = 7,
        Q8_0 = 8,
        Q8_1 = 9,
        Q2_K = 10,
        Q3_K = 11,
        Q4_K = 12,
        Q5_K = 13,
        Q6_K = 14,
        Q8_K = 15,
        I8 = 16,
        I16 = 17,
        I32 = 18,
        COUNT = 19,
    }
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub enum ggml_prec {
        DEFAULT = 0,
        F32 = 1,
    }
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub enum ggml_backend_type {
        GGML_BACKEND_CPU = 0,
        GGML_BACKEND_GPU = 10,
        GGML_BACKEND_GPU_SPLIT = 20,
    }
